# Base Brewfile - core packages for dotfiles setup
# Personal packages should go in Brewfile.extra

tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"

# -----------------------------------------
# Core CLI tools
# -----------------------------------------
brew "git"
brew "git-lfs"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "tmux"
brew "stow"
brew "zsh"

# -----------------------------------------
# Shell & prompt
# -----------------------------------------
brew "starship"
brew "zoxide"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# -----------------------------------------
# Development languages & tools
# -----------------------------------------
brew "node"
brew "typescript"
brew "python"
brew "go"
brew "rust"

# -----------------------------------------
# Utilities
# -----------------------------------------
brew "bat"
brew "jq"
brew "tree"
brew "htop"
brew "lazygit"
brew "glow"
brew "direnv"
brew "gh"
brew "google-cloud-sdk"

# -----------------------------------------
# Terminal & UI
# -----------------------------------------
cask "kitty"
cask "alfred"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# -----------------------------------------
# Development apps
# -----------------------------------------
cask "docker-desktop"
cask "visual-studio-code"
cask "cursor"
