tap "nikitabobko/tap"
brew "git"
brew "neovim"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "starship"
brew "tmux"
cask "kitty"
cask "alfred"
cask "nikitabobko/tap/aerospace"
cask "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
brew "node"
brew "typescript"
brew "python"
brew "direnv"
brew "gh"
cask "docker-desktop"
cask "visual-studio-code"
cask "cursor"
cask "notion"
cask "spotify"
cask "linear-linear"
cask "chatgpt"
